-*- Mode: org; mode: auto-fill; fill-column: 76; org-download-image-dir: "~/Documents/leandro/scrapping-tutorial/img" -*-

*** create the project and spiders

      #+begin_src sh
      scrapy startproject craigslist
      cd craiglist
      scrapy genspider jobs https://newyork.craigslist.org/search/egr
      #+end_src


    See the project folders
      #+begin_src sh :results output
       tree
      #+end_src

      #+RESULTS:
      #+begin_example
      .
      ├── craigslist
      │   ├── craigslist
      │   │   ├── __init__.py
      │   │   ├── items.py
      │   │   ├── middlewares.py
      │   │   ├── pipelines.py
      │   │   ├── __pycache__
      │   │   │   ├── __init__.cpython-36.pyc
      │   │   │   └── settings.cpython-36.pyc
      │   │   ├── settings.py
      │   │   └── spiders
      │   │       ├── __init__.py
      │   │       ├── jobs.py
      │   │       └── __pycache__
      │   │           └── __init__.cpython-36.pyc
      │   └── scrapy.cfg
      ├── LICENSE
      └── README.org

      5 directories, 13 files
      #+end_example
      
      The commands creates all the folders and the spider code

      #+begin_src python
        # -*- coding: utf-8 -*-
        import scrapy

        class JobsSpider(scrapy.Spider):
            name = 'jobs'  # spider name

            # the list of the domains that the spider is allowed scrape.
            allowed_domains = ['craigslist.org']

            # the list of one or more URL(s) with which the spider starts crawling.
            start_urls = ['https://newyork.craigslist.org/search/egr/']

            # main pider function used to extract the target data of the web page
            def parse(self, response):
                pass

      #+end_src

